emas/loadtest/emas-performance-report/raw_data/sp1/apache_bench_data/10cus/varnish_ab_test_10_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      10
Time taken for tests:   0.049 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32551000 bytes
HTML transferred:       31966000 bytes
Requests per second:    20597.32 [#/sec] (mean)
Time per request:       0.486 [ms] (mean)
Time per request:       0.049 [ms] (mean, across all concurrent requests)
Transfer rate:          654749.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.1      0       1
Waiting:        0    0   0.1      0       1
Total:          0    0   0.2      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      1
  95%      1
  98%      1
  99%      1
 100%      2 (longest request)