emas/loadtest/emas-performance-report/raw_data/sp1/apache_bench_data/10cus/varnish_ab_test_10_100000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      10
Time taken for tests:   5.350 seconds
Complete requests:      100000
Failed requests:        0
Write errors:           0
Total transferred:      3255100000 bytes
HTML transferred:       3196600000 bytes
Requests per second:    18690.17 [#/sec] (mean)
Time per request:       0.535 [ms] (mean)
Time per request:       0.054 [ms] (mean, across all concurrent requests)
Transfer rate:          594124.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       4
Processing:     0    0   0.2      0      20
Waiting:        0    0   0.2      0      19
Total:          0    1   0.2      0      20
ERROR: The median and mean for the total time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%     20 (longest request)